import streamlit as st

# 웹 이름
st.title("오늘의 운세 확인하기")
st.info("이건 참고용 입니다")

#오늘의 날짜
st.title("★오늘의 날짜")

from datetime import date

today = date.today()
st.subheader(today)

#대길 대흉

col1, col2 , col3 ,col4 = st.columns(4)
with col1:    
    st.subheader("대길")
    st.subheader("대흉")
with col2:    
    st.subheader("토끼띠")
    st.subheader("개띠")   
with col3:        
    st.subheader("돼지띠")
    st.subheader("뱀띠")
with col4:
    st.subheader("말띠")
    st.subheader("쥐띠")

#각 띠들의 운세

tab_title = ['쥐','소','호랑이','토끼','용','뱀','말','양','원숭이','닭','개','돼지']
tab1,tab2,tab3,tab4,tab5,tab6,tab7,tab8,tab9,tab10,tab11,tab12 = st.tabs(tab_titles)

with tab1:
    st.header('쥐')
    st.write('그동안 열심히 살아온 당신이기에 오늘 하루는 심신을 단련하는 것이 좋겠다. 무리한 계획에 의한 행동은 오히려 몸이 힘들 수 있고 실제로 득이 되는 건 그다지 많지 않을 것이다. 오늘은 다급하게 움직이지 말고 효율성을 중요하게 여겨야 하는 날이다.')
with tab2:
    st.header('소')
    st.write('연인을 만난다면 상대방이 충분히 알 수 있도록 애정표현을 해야 한다. 당신의 정확한 표현이 좋은 결과로 연결 되기 때문이다. 조그마한 차이가 모든 삶의 행복과 불행을 결정짓는 중요한 결과로 다가올 수 있다. 개방적인 사고와 표현이 당신을 위한 큰 무기가 될 수가 있으며 또한 든든한 보호막이 될 수도 있다.')
with tab3:
    st.header('호랑이')
    st.write('평소에 자주 왕래가 없었던 사람이 조언을 구해온다면 최대한 친절하게 응대하는 것이 좋겠다. 훗날 자신도 이와 유사한 상황이 올 것이며 이때 귀한 도움을 받을 수 있다. 주부일 경우에는 자신이 먼저 마음을 열고, 자식과 편안하게 대화를 할 수 있는 상황을 연출하는 것이 좋을 것이다.')
with tab4:
    st.header('토끼')
    st.write('조금만 더 수고하여 어려운 고비를 넘기면 마침내 얻을 수 있으니, 인내심으로 참고 견디는 방법이 최선의 길이 될 것이다. 사업가는 금전 융통이 수월할 수 있으니, 투자 가능성이 보이는 길에 용기를 가지고 과감하게 도전할 수 있을 것이다.')
with tab5:
    st.header('용')
    st.write('계획성 없이 진행하는 일인 경우 좋은 성과를 기대하기 힘들 수 있으니, 하루의 시작은 철저히 계획한 후에 진행하는 것이 유리하다. 또한 만약의 상황을 생각했을 때 미흡한 점이 있다면, 만반의 준비를 갖추는 일에 신경을 기울여야 기대 이상의 결실을 얻을 수 있을 것이다.')
with tab6:
    st.header('뱀')
    st.write('재물보다는 명예를 우선시 생각해야 한다. 또한 가급적 불필요한 저녁 나들이는 피해는 게 좋겠다. 특히 오늘은 육체적 상태가 최고조에 있으니 잊지 말고 건강을 위해서 운동을 하도록 하라. 물론 꾸준히 하는 것이 좋겠다. 건강이 있어야 행복도 따름을 기억함이 옳다.')
with tab7:
    st.header('말')
    st.write('지금은 비록 육체가 편안하고 원하는 대로 모든 일이 이루어 진다고 생각되어도 방심하면 좋은 결과를 기대하기 힘들 수 있다. 원하는걸 이루기는 어려워도 잃어버리는 것은 한 순간이다. 편안하게 상황을 주시하는 것은 좋으나, 약간의 긴장감을 유지하면 좋은 기운을 계속 유지할 수 있겠다.')
with tab8:
    st.header('양')
    st.write('육체적, 정신적으로 활력이 샘솟고, 어떤 일이든 할 수 있을 만큼 좋은 상태이다. 가능하다면 적극적으로 자신에게 주어진 일에 최선을 다하는 것이 당신이나 주위사람들을 위해서도 유리하다. 힘찬 활력으로 하루를 시작하라. 좋은 결과가 기다리고 있다.')
with tab9:
    st.header('원숭이')
    st.write('자신의 실수를 먼저 인정하고 상대를 대하는 것이 유리하게 작용되는 하루다. 먼저 자존심을 접고 고개를 숙여주면 여러모로 편하게 당신이 원하는 걸 이룰 수 있겠다. 오히려 겸손함의 미덕 속에서 자신의 가치가 빛을 발할 수 있는 하루이니 조금만 물러설 줄 알아야 한다.')
with tab10:
    st.header('닭')
    st.write('오전보다는 오후에 꾸준히 운기가 회복하고 있으니 걱정할 필요가 없다. 욕심을 약간만 버리면 괜찮은 결과를 얻을 수 있는 하루다. 새로운 일이 연이어서 찾아올 것이니, 시간 관리를 잘 해서 하나라도 더 건지도록 노력해야 한다. 기회는 올 때 잡는 것이 현명한 처사이다')
with tab11:
    st.header('개')
    st.write('어려운 시기가 사라지고 당신의 시기가 온다. 그동안 참고 지내 온 날들이 보상받는 날이다. 그렇다고 너무 자랑스레 주위에 알릴 필요는 없다. 이러한 즐거움은 혼자서 만끽해도 충분하다. 진정한 승리는 자신과의 싸움임을 잊지 않도록.')
with tab12:
    st.header('돼지')
    st.write('진행하는 일에서 약간의 난처한 상황이 발생할 수도 있게 되는데 생각지도 못한 사람에게서 도움을 받을 수 있으니 오히려 전화위복이 되겠다. 이는 훗날 꼭 갚아야 함이 옳다. 세상이 빠르게 바뀌어 간다 하여 편승하려는 생각은 가급적 안 하는 게 좋겠다. 당신 인생의 항로는 당신의 손으로 결정하는 게 거시적으로 유리하다.')
#나의 운세 확인하기

st.title ("당신의 운세")

#생년월일 입력

birthday = st.text_input("생년월일을 입력하세요")

if st.button("확인하기"):
    if birthday:
        st.success(f"{birthday} 조금만 더 수고하여 어려운 고비를 넘기면 마침내 얻을 수 있으니 인내심으로 참고 견디는 방법이 최선의 길이 될 것이다")
    else :
        st.Warning()
    



